Autodesk.Revit.DB.Structure.AnalyticalModel.IsSurface
Checks if the analytical model belongs to the surface object like floor, slab or wall.
Returns:
True is returned when this object is AnalyticalModelSurface class, false otherwise.
Since:
2011

Autodesk.Revit.DB.Structure.AnalyticalModel.SetAnalyticalProjectionDatumPlane(Autodesk.Revit.DB.Structure.AnalyticalElementSelector,Autodesk.Revit.DB.Structure.AnalyticalDirection,Autodesk.Revit.DB.ElementId)
Sets the datum plane for a given selector and direction.
Remarks:
Applicable for analytical models of linear elements (beams, braces, columns).
This Datum Plane identifies a Level, a Grid, or a Ref Plane.
selector:
End of the analytical model.
direction:
Direction in which analytical model may be projected.
datumPlaneId:
Datum Plane on to which analytical model may be projected.
Throws Autodesk.Revit.Exceptions.ArgumentException:
direction is invalid for analytical model
-or-
Datum Plane is invalid projection target.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2012

Autodesk.Revit.DB.Structure.AnalyticalModel.GetAnalyticalProjectionDatumPlane(Autodesk.Revit.DB.Structure.AnalyticalElementSelector,Autodesk.Revit.DB.Structure.AnalyticalDirection)
Gets the datum plane for a given selector and direction.
Remarks:
Applicable for analytical models of linear elements (beams, braces, columns).
This Datum Plane identifies a Level, a Grid, or a Ref Plane.
selector:
End of the analytical model.
direction:
Direction in which analytical model is projected.
Returns:
Datum Plane on to which analytical model is projected, or invalidElementId if
not projected to a Datum Plane.
Throws Autodesk.Revit.Exceptions.ArgumentException:
direction is invalid for analytical model
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2012

Autodesk.Revit.DB.Structure.AnalyticalModel.SetAlignmentMethod(Autodesk.Revit.DB.Structure.AnalyticalElementSelector,Autodesk.Revit.DB.Structure.AnalyticalDirection,Autodesk.Revit.DB.Structure.AnalyticalAlignmentMethod)
Sets the alignment method for a given selector and direction.
Remarks:
Applicable for analytical models of linear elements (beams, braces, columns).
selector:
End of the analytical model.
direction:
Direction of the analytical model.
method:
The alignment method at a given end.
Throws Autodesk.Revit.Exceptions.ArgumentException:
direction is invalid for analytical model
-or-
method is in valid for analytical model
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2012

Autodesk.Revit.DB.Structure.AnalyticalModel.GetAlignmentMethod(Autodesk.Revit.DB.Structure.AnalyticalElementSelector,Autodesk.Revit.DB.Structure.AnalyticalDirection)
Gets the alignment method for a given selector and direction.
Remarks:
Applicable for analytical models of linear elements (beams, braces, columns).
selector:
End of the analytical model.
direction:
Direction of the analytical model.
Returns:
The alignment method at a given end.
Throws Autodesk.Revit.Exceptions.ArgumentException:
direction is invalid for analytical model
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2012

Autodesk.Revit.DB.Structure.AnalyticalModel.GetSweptProfile
Retrieves the swept profile information for Analytical Model.
Returns:
The swept profile information for the Analytical Model.
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
This AnalyticalModel does not support a swept profile representation.
Since:
2011

Autodesk.Revit.DB.Structure.AnalyticalModel.SetAnalyticalProjectionType(Autodesk.Revit.DB.Structure.AnalyticalElementSelector,Autodesk.Revit.DB.Structure.AnalyticalDirection,Autodesk.Revit.DB.Structure.AnalyticalProjectionType)
Sets the analytical model projection to a preset value.
Remarks:
This should be used if setting the analytical model projection to something
other than a Datum Plane.
selector:
End of the analytical model.
direction:
Direction of the analytical model.
projectionType:
Preset value for Analytical Model projection.
Throws Autodesk.Revit.Exceptions.ArgumentException:
direction is invalid for analytical model
-or-
The analytical model does not provide projectionType for the selector or direction
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2011

Autodesk.Revit.DB.Structure.AnalyticalModel.GetAnalyticalProjectionType(Autodesk.Revit.DB.Structure.AnalyticalElementSelector,Autodesk.Revit.DB.Structure.AnalyticalDirection)
Retrieves Analytical Model projection information for a specific direction.
in direction:  direction in which the Analytical Model may be projected.
selector:
End of the analytical model.
direction:
Direction of the analytical model.
Returns:
Indicates if the projection is a preset value, or refers to a Datum Plane.
Throws Autodesk.Revit.Exceptions.ArgumentException:
direction is invalid for analytical model
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2011

Autodesk.Revit.DB.Structure.AnalyticalModel.GetLocalCoordinateSystem
Gets the local coordinate system (LCS) for an analytical model element.
Returns:
Transformation matrix.
Returns null for curved beam and arc wall analytical model element.
Origin is always (0, 0, 0).
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when called on Isolated Foundation and Wall Foundation analytical model element.
Those elements do not support local coordinate system.
Since:
2011

Autodesk.Revit.DB.Structure.AnalyticalModel.HasSweptProfile
Indicates if this Element's Analytical Model can be represented as a swept profile.
Returns:
True if the Analytical Model can be represented as a swept profile, false otherwise.
Since:
2011

Autodesk.Revit.DB.Structure.AnalyticalModel.HasAlignment(Autodesk.Revit.DB.Structure.AnalyticalDirection)
Checks if analytical alignment is applicable at a given end.
Remarks:
True for analytical models of linear elements (beams, braces, columns).
direction:
The direction of the analytical model.
Returns:
True if analytical alignment is supported.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2012

Autodesk.Revit.DB.Structure.AnalyticalModel.IsValidProjectionDatumPlane(Autodesk.Revit.DB.Structure.AnalyticalElementSelector,Autodesk.Revit.DB.Structure.AnalyticalDirection,Autodesk.Revit.DB.ElementId)
Indicates if a given Datum Plane is valid for analytical model projection
with respect to the given analytical direction.
Remarks:
Validity of a Datum Plane for analytical projection is both element
and context specific. For instance, two different Beams may have two
different results.
selector:
End of the analytical model.
direction:
Direction of analytical model projection.
datumPlaneId:
Datum Plane on to which analytical model is projected.
Returns:
True if Datum Plane is valid, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2011

Autodesk.Revit.DB.Structure.AnalyticalModel.IsValidSelectorAndDirection(Autodesk.Revit.DB.Structure.AnalyticalElementSelector,Autodesk.Revit.DB.Structure.AnalyticalDirection)
Indicates if the input selector is valid for analytical direction for Analytical Model.
selector:
Selector of element part
direction:
Direction which will be validated for the Analytical Model
Returns:
True if selector is valid for given direction, false otherwise
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2011

Autodesk.Revit.DB.Structure.AnalyticalModel.IsValidDirectionForProjection(Autodesk.Revit.DB.Structure.AnalyticalDirection)
Indicates if the input direction is valid for Analytical Model projection.
direction:
Direction in which the Analytical Model may be projected.
Returns:
True if AnalyticalDirection is valid for Element, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2011

Autodesk.Revit.DB.Structure.AnalyticalModel.IsValidProjectionType(Autodesk.Revit.DB.Structure.AnalyticalElementSelector,Autodesk.Revit.DB.Structure.AnalyticalDirection,Autodesk.Revit.DB.Structure.AnalyticalProjectionType)
Indicates if a given Analytical Projection Type is valid for the given
Analytical Element Selector and Analytical Direction.
selector:
Selector of element part.
direction:
Direction in which Analytical Model may be projected.
projectionType:
Analytical Projection Type for Analytical Model Projection.
Returns:
True if Projection Type is valid; false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2011